dsgt-soap/requestorder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addOrderRequest>
            <gs:order>
                <gs:orderee>Harry Potter</gs:orderee>
                <gs:meal>
                    <gs:name>Fish and Chips</gs:name>
                    <gs:kcal>950</gs:kcal>
                    <gs:description>Fried fish with chips</gs:description>
                    <gs:mealtype>fish</gs:mealtype>
                    <gs:price>21.79</gs:price>
                </gs:meal>
            </gs:order>
        </gs:addOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>